#Задача 2. Вариант 17.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Ас-Cамарканди. Не забудьте о том, что автор должен быть упомянут на отдельной строке.


print('Тот, кто требует лишнего, несчастен.')
print('\n'+' '*30 + 'Ас-Cамарканди')
input("\n\nНажмите Enter для выхода.")