#Задача 1. Вариант 17.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Алексей Максимович Пешков. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.


print ("Алексей Максимович Пешков более известный как Алексей Максимович Горький является русским писателем, прозаиком, драмматургом.")
input ("Нажмите Enter,чтобы выйти")
